{
  "courseId": {
    "lessonId": {
      "title": "অ্যারোমেটিসিটি Aromaticity",
      "content": [
        "রসায়নবিদ হাকেল (Eric Huckel, 1931) অ্যারোমেটিক যৌগের বিশেষ ধর্ম বা অ্যারোমেটিসিটি প্রকাশের শর্তরূপে সঞ্চরণশীল গ ইলেকট্রন সহযোগে আণবিক অরবিটাল গঠন তত্ত্ব উপস্থাপন করেন; একে হাকেল তত্ত্ব বলে।",
        "হাকেল নিয়মগুলো নিম্নরূপ : \n (১) জৈব যৌগটির গঠন চেণ্টা সমতলীয় চাক্রিক হতে হবে। চক্র বা বলয় গঠনকারী পরমাণুর সংখ্যা 5 অথবা 6টি হতে হবে। ঐ বলয় সিস্টেমে সব অরবিটাল দ্বারা বন্ধন গঠন পূর্ণ থাকে।",
        "*(২) বলয় বা চক্র গঠনকারী প্রতিটি পরমাণুতে p-অরবিটাল থাকতে হবে। এ সব p-অরবিটাল মূল বলয়ের তলের ওপর ও নিচের দিকে পাশাপাশি অধিক্রমণ দ্বারা সঞ্চরণশীল অবস্থায় চক্রাকারে আণবিক অরবিটাল গঠন করবে। এ আণবিক অরবিটালে সঞ্চরণশীল । ইলেকট্রন সংখ্যা অবশ্যই (4n + 2) দ্বারা নির্ধারিত হবে। এখানে n দ্বারা সুষম পঞ্চভুজ অথবা ষড়ভুজ বলয় বা চক্রের সংখ্যা বোঝানো হয়। n = 0, 1, 2, 3 ইত্যাদি পূর্ণ সংখ্যা হবে। যেমন"
      ]
    },
    "lessonId2": {
      "title": "মুক্তমূলক বা থ্রি-রেডিকেল (free radical)",
      "content": [
        "বিকারক অণুর সমযোজী বন্ধন তাপ বা আলোর প্রভাবে সমভাঙ্গন (homolysis) দ্বারা ফ্রি-রেডিকেল উৎপন্ন হয়। ",
        "যেমন, সূর্যালোক (hu) এর উপস্থিতিতে Cl½ অণুর সমভাঙ্গনের ফলে ক্লোরিন ফ্রি-রেডিকেল (CI) উৎপন্ন হয়।",
        "অ্যালকাইল ফ্রি-রেডিকেল : অ্যালকেন অণুর কার্বন-কার্বন সিগমা বন্ধনের সমভাঙ্গনের ফলে অ্যালকাইল ফ্রি-রেডিকেল তৈরি হয় ।",
        "অ্যালকাইল ফ্রি রেডিকেলের সক্রিয়তা ও স্থায়িত্ব: 3° - অ্যালকাইল > 2° - অ্যালকাইল ফ্রি রেডিকেল > 1° - অ্যালকাইল > মিথাইল"
      ]
    },
    "lessonId3": {
      "title": "কার্বোনিয়াম আয়ন",
      "content": [
        "একক ধনাত্মক চার্জের কার্বন পরমাণুযুক্ত জৈব আয়নকে কার্বোনিয়াম আয়ন বা কার্বোক্যাটায়ন (carbocation) বলে",
        "যেমন, মিথাইল কার্বোনিয়াম আয়ন, +CH3; ইথাইল কার্বোনিয়াম আয়ন, + CH 2 CH3",
        "উৎপত্তি : জৈব অণুস্থিত সিগমা বন্ধনের অসম ভাঙ্গনের ফলে ধনাত্মক চার্জযুক্ত অ্যালকাইল মূলক বা কার্বোনিয়াম আয়ন.",
        "কার্বোনিয়াম আয়নসমূহের সক্রিয়তা ও স্থায়িত্ব : কার্বোনিয়াম আয়ন ইলেকট্রন ঘাটতি হওয়ায় ইলেকট্রোফাইলরূপে খুবই সক্রিয় । কার্বোনিয়াম আয়নসমূহের স্থায়িত্বের ক্রম অ্যালকাইল ফ্রি রেডিকেলের অনুরূপ হয়। *CR3 > *CHR2 > *CH2R > *CH3"
      ]
    },
    "lessonId4": {
      "title": "কার্যানায়ন",
      "content": [
        " একক ঋণাত্মক চার্জের কার্বন পরমাণু যুক্ত জৈব আয়নকে কার্বানায়ন বলে। যেমন, মিথাইল কার্বানায়ন: CH3; ইথাইল কার্বানায়ন : CH 2 CH 3 |",
        "উৎপত্তি : জৈব যৌগের আলফা হাইড্রোজেন (a-H) পরমাণু অম্লধর্মী হলে তখন লঘু ক্ষার দ্রবণের উপস্থিতিতে কার্বানায় সৃষ্টি হয় ",
        "কাবানায়নের সক্রিয়তা ও স্থায়িত্ব : কার্বানায়ন ইলেকট্রন সমৃদ্ধ হওয়ায় নিউক্লিওফাইলরূপে খুবই সক্রিয় কার্বানায়নসমূহের স্থায়িত্বের ক্রম কার্বোনিয়াম আয়নসমূহের বিপরীত। যেমন,: CH3 > 1°:  CH2R > 1° CHR2 > 2° : CR3 3°"
      ]
    },
    "lessonId5": {
      "title": "নিউক্লিওফাইল বা কেন্দ্রাকর্ষী বিকারক:",
      "content": [
        "বিকারক অণুর দ্রাবক অথবা প্রভাবকের দ্বারা বন্ধনের অসম ভাঙ্গন) (heterolysis) দ্বারা সৃষ্ট ধনাত্মক মূলককে ইলেকট্রোফাইল (electrophile) ও ঋণাত্মক মূলককে নিউক্লিওফাইল (nucleophile) বলা হয়",
        "(১) ঋণাত্মক নিউক্লিওফাইল",
        "(২) প্রশম নিউক্লিওফাইল (Nu)",
        "নিউক্লিওফাইলের উদাহরণ হলো : HO, ROCN, Cl, Br, f"
      ]
    },
    "lessonId6": {
      "title": "সংযোজন বিক্রিয়া (Addition)",
      "content": [
        "সংযোজন বিক্রিয়ায় দুটি ভিন্ন অণু যুক্ত হয়।",
        "পাই (7) বন্ধনযুক্ত কার্যকরী মূলক যেমন কার্বন-কার্বন দ্বিবন্ধন (C=C), কার্বন-কার্বন ত্রিবন্ধন (C=C) ও কার্বনিল মূলক (X = 0 ) যুক্ত জৈব যৌগে সংযোজন বিক্রিয়া ঘটে।",
        "ফলে পাই (7) বন্ধনটি ভেঙ্গে দুটি সিগমা (C) বন্ধন সৃষ্টি হয়।",
        " তখন উৎপন্ন যৌগে C পরমাণুতে যুক্ত পরমাণু সংখ্যা বৃদ্ধি পায় । অ্যালকিনের কার্বন-কার্বন (C = C) দ্বিবন্ধনের ইলেকট্রন উভয় C-পরমাণুতে সমভাবে থাকে;",
        "* কার্বন-কার্বন (C=C) দ্বিবন্ধনে ইলেকট্রোফিলিক সংযোজন ঘটে;",
        "* কিন্তু কার্বনিল মূলকের (C=O) দ্বিবন্ধন পোলার হওয়ায় আংশিক ধনাত্মক C-পরমাণুতে নিউক্লিওফিলিক সংযোজন ঘটে।",
        "* সংযোজন বিক্রিয়া অ্যালিফেটিক ও অ্যারোমেটিক উভয় শ্রেণির পাই (1) বন্ধন যুক্ত যৌগে ঘটে।",
        "★ প্রায় 180° - 200°C তাপমাত্রায় নিকেল প্রভাবকের উপস্থিতিতে ইথিন ও বেনজিনের সাথে পৃথকভাবে H2 সংযোজন বিক্রিয়ায় যথাক্রমে ইথেন ও সাইক্লোহেক্সেন উৎপন্ন হয়। এক্ষেত্রে এ প্রভাবকীয় হাইড্রোজেন সংযোজনকালে দুটি H পরমাণু সৃষ্টি হয়; ফলে ফ্রি-রেডিকেল সংযোজন ঘটে"
      ]
    }
  }
}